ubi-naist/SenStick/nRF5_SDK_12/examples/peripheral/usbd/main.c
static void usbd_setup_SetFeature(nrf_drv_usbd_setup_t const * const p_setup)
{
    if( (p_setup->bmRequestType) == 0x02 ) // standard request, recipient=endpoint
    {
        if(((p_setup->wValue) == 0) && (((p_setup->wIndex) >> 8) == 0))
        {/** @todo RK missing EP0 IN and OUT support */
            if(((p_setup->wIndex) & 0xff) == NRF_DRV_USBD_EPIN1)
            {
                nrf_drv_usbd_ep_stall(NRF_DRV_USBD_EPIN1);
                nrf_drv_usbd_setup_clear();
                return;
            }
        }
    }
    nrf_drv_usbd_setup_stall();
}

static void usbd_setup_GetDescriptor(nrf_drv_usbd_setup_t const * const p_setup)
{
    //determine which descriptor has been asked for
    switch((p_setup->wValue) >> 8)
    {
    case 1: // Device
        if((p_setup->bmRequestType) == 0x80)
        {
            respond_setup_data(
                p_setup,
                get_descriptor_device,
                sizeof(get_descriptor_device));
            return;
        }
        break;
    case 2: // Configuration
        if((p_setup->bmRequestType) == 0x80)
        {
            respond_setup_data(
                p_setup,
                get_descriptor_configuration,
                GET_CONFIG_DESC_SIZE);
            return;
        }
        break;
    case 3: // String
        if((p_setup->bmRequestType) == 0x80)
        {
            // Select the string
            switch((p_setup->wValue) & 0xFF)
            {
            case USBD_STRING_LANG_IX:
                respond_setup_data(
                    p_setup,
                    get_descriptor_string_lang,
                    sizeof(get_descriptor_string_lang));
                return;
            case USBD_STRING_MANUFACTURER_IX:
                respond_setup_data(
                    p_setup,
                    get_descriptor_string_manuf,
                    sizeof(get_descriptor_string_manuf));
                return;
            case USBD_STRING_PRODUCT_IX:
                respond_setup_data(p_setup,
                    get_descriptor_string_prod,
                    sizeof(get_descriptor_string_prod));
                return;
            default:
                break;
            }
        }
        break;
    case 4: // Interface
        if((p_setup->bmRequestType) == 0x80)
        {
            // Witch interface?
            if((((p_setup->wValue) & 0xFF) == 0))
            {
                respond_setup_data(
                    p_setup,
                    get_descriptor_interface_0,
                    GET_INTERFACE_DESC_SIZE);
                return;
            }
        }
        break;
    case 5: // Endpoint
        if((p_setup->bmRequestType) == 0x80)
        {
            // Witch endpoint?
            if((((p_setup->wValue) & 0xFF) == 1))
            {
                respond_setup_data(
                    p_setup,
                    get_descriptor_endpoint_1,
                    GET_ENDPOINT_DESC_SIZE);
                return;
            }
        }
        break;
    case 0x21: // HID
        if((p_setup->bmRequestType) == 0x81)
        {
            // Witch interface
            if((((p_setup->wValue) & 0xFF) == 0))
            {
                respond_setup_data(
                    p_setup,
                    get_descriptor_hid_0,
                    GET_HID_DESC_SIZE);
                return;
            }
        }
        break;
    case 0x22: // HID report
        if((p_setup->bmRequestType) == 0x81)
        {
            //which interface?
            if((((p_setup->wValue) & 0xFF) == 0))
            {
                respond_setup_data(
                    p_setup,
                    get_descriptor_report_interface_0,
                    sizeof(get_descriptor_report_interface_0));
                return;
            }
        }
        break;
    default:
        break; // Not supported - go to stall
    }

    nrf_drv_usbd_setup_stall();
}

static void usbd_setup_GetConfig(nrf_drv_usbd_setup_t const * const p_setup)
{
    if(m_usbd_configured)
    {
        respond_setup_data(
            p_setup,
            get_config_resp_configured,
            sizeof(get_config_resp_configured));
    }
    else
    {
        respond_setup_data(
            p_setup,
            get_config_resp_unconfigured,
            sizeof(get_config_resp_unconfigured));
    }
}

static void usbd_setup_SetConfig(nrf_drv_usbd_setup_t const * const p_setup)
{
    if (p_setup->bmRequestType == 0x00)
    {
        // accept only 0 and 1
        if(((p_setup->wIndex) == 0) && ((p_setup->wLength) == 0))
        {
            if( (p_setup->wValue) == 1 )
            {
                nrf_drv_usbd_ep_enable(NRF_DRV_USBD_EPIN1);
                m_usbd_configured = true;
                nrf_drv_usbd_setup_clear();
                return;
            }
            else if( (p_setup->wValue) == 0 )
            {
                nrf_drv_usbd_ep_disable(NRF_DRV_USBD_EPIN1);
                m_usbd_configured = false;
                nrf_drv_usbd_setup_clear();
                return;
            }
            else
            {
                // Wrong value
            }
        }
    }
    nrf_drv_usbd_setup_stall();
}

static void usbd_setup_SetIdle(nrf_drv_usbd_setup_t const * const p_setup)
{
    if (p_setup->bmRequestType == 0x21)
    {
        //accept any value
        nrf_drv_usbd_setup_clear();
        return;
    }
    nrf_drv_usbd_setup_stall();
}

static void usbd_setup_SetInterface(
    nrf_drv_usbd_setup_t const * const p_setup)
{
    //no alternate setting is supported - STALL always
    nrf_drv_usbd_setup_stall();
}

static void usbd_setup_SetProtocol(
    nrf_drv_usbd_setup_t const * const p_setup)
{
    if (p_setup->bmRequestType == 0x21)
    {
        //accept any value
        nrf_drv_usbd_setup_clear();
        return;
    }
    nrf_drv_usbd_setup_stall();
}

