ubi-naist/SenStick/nRF5_SDK_12/examples/peripheral/usbd/main.c
    /* Configure LED and button */
    bsp_board_leds_init();
    bsp_board_led_on(LED_RUNNING);
    bsp_board_led_on(LED_ACTIVE);


    if(USBD_POWER_DETECTION)
    {
        static const nrf_drv_power_usbevt_config_t config =
        {
            .handler = power_usb_event_handler
        };
        nrf_drv_power_usbevt_init(&config);
    }
    else
    {
        NRF_LOG_INFO("No USB power detection enabled\r\nStarting USB now\r\n");
        nrf_delay_us(STARTUP_DELAY);
        if(!nrf_drv_usbd_is_enabled())
        {
            nrf_drv_usbd_enable();
        }
        /* Wait for regulator power up */
        while(NRF_DRV_POWER_USB_STATE_CONNECTED
              ==
              nrf_drv_power_usbstatus_get())
        {
            /* Just waiting */
        }

        if(NRF_DRV_POWER_USB_STATE_READY == nrf_drv_power_usbstatus_get())
        {
            if(!nrf_drv_usbd_is_started())
            {
                nrf_drv_usbd_start(true);
            }
        }
        else
        {
            nrf_drv_usbd_disable();
        }
    }


    while (true)
    {
        if(m_system_off_req)
        {
            NRF_LOG_INFO("Going to system OFF\r\n");
            NRF_LOG_FLUSH();
            bsp_board_led_off(LED_RUNNING);
            bsp_board_led_off(LED_ACTIVE);
            nrf_power_system_off();
        }
        if(m_usbd_configured)
        {
            if (bsp_board_button_state_get(BTN_MOUSE_MOVE))
            {
                NRF_LOG_INFO("   TX pointer\r\n");
                move_mouse_pointer();
            }
        }
        else if(USBD_POWER_DETECTION)
        {
            NRF_LOG_FLUSH();
            bsp_board_led_off(LED_RUNNING);
            /* Even if we miss an event enabling USB,
             * USB event would wake us up. */
            __WFE();
            /* Clear SEV flag if CPU was woken up by event */
            __SEV();
            __WFE();
            bsp_board_led_on(LED_RUNNING);
        }
        else
        {
            /* Nothing to do */
        }
        UNUSED_RETURN_VALUE(NRF_LOG_PROCESS());
    }
}
